/*
 * 习题6
 * 输出以下的杨辉三角形（要求输出 10 行）。
 * 1
 * 1   1
 * 1   2   1
 * 1   3   3   1
 * 1   4   6   4   1
 * 1   5  10  10   5   1
 * :   :   :   :   :   :
 */

#include <stdio.h>

int main()
{
    int a[10][10] = {0}, i, j;

    // 计算杨辉三角形
    for (i = 0; i < 10; i++)
    {
        a[i][0] = 1;        // 每行第一个数为1
        a[i][i] = 1;        // 每行最后一个数为1
        for (j = 1; j < i; j++)
            a[i][j] = a[i - 1][j - 1] + a[i - 1][j];
    }

    // 输出杨辉三角形
    for (i = 0; i < 10; i++)
    {
        for (j = 0; j <= i; j++)
            printf("%6d", a[i][j]);
        printf("\n");
    }

    getchar();
    return 0;
}
